{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [3, 3, 1, 32], "name": "conv2d_1/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_1/bias"}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "shape": [3, 3, 32, 64], "name": "conv2d_2/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_2/bias"}]}, {"paths": ["group3-shard1of2", "group3-shard2of2"], "weights": [{"dtype": "float32", "shape": [9216, 128], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [128], "name": "dense_1/bias"}]}, {"paths": ["group4-shard1of1"], "weights": [{"dtype": "float32", "shape": [128, 10], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [10], "name": "dense_2/bias"}]}], "modelTopology": {"model_config": {"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3, 3], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "strides": [1, 1], "batch_input_shape": [null, 28, 28, 1], "bias_constraint": null, "filters": 32, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3, 3], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "strides": [1, 1], "bias_constraint": null, "filters": 64, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true, "name": "max_pooling2d_1", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_constraint": null, "units": 128, "bias_regularizer": null, "kernel_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_2", "rate": 0.5}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "bias_constraint": null, "units": 10, "bias_regularizer": null, "kernel_constraint": null, "trainable": true}}]}, "keras_version": "2.2.0", "training_config": {"loss_weights": null, "metrics": ["accuracy"], "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "Adadelta", "config": {"epsilon": 1e-07, "rho": 0.95, "lr": 1.0, "decay": 0.0}}, "sample_weight_mode": null}, "backend": "tensorflow"}}